code-review/NRB_3471_3546/База_Стало/DataProcessors/ОтправкаПериодическихВыписокПоСчетуДЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтправкаПериодическихВыписокПоСчетуДЕПО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выписка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийПакетВФШ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИсходящийПакетВФайловыйШлюз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТехническаяОперация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/СтатусыПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПоручений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПоручения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоручений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИсполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ДокументыВыгруженныеВЛуч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыВыгруженныеВЛуч</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыгрузкаРазделаРСВвВышестоящийДепозитарий</v8:Type>
						<v8:Type>cfg:DocumentRef.НеттоПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Выписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Comment>На начало(0), На конец операционного дня(1)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Comment>Произвольный текст для вывода в соответствующее поля отчета о совершенной операции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДопИнформацию</Name>
					<Comment>Если требуется заблокировать автоматичсекое обновление поля, то следует установить этот флаг.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ИсходящийПакетВФайловыйШлюз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИсходящийПакетВФайловыйШлюз</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий1024</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйПуть</Name>
					<Comment>Полный путь каталога сохранения файлов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтносительныйПуть</Name>
					<Comment>Относительный путь сохранения файлов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ФормированиеОтчетаВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФормированиеОтчетаВыписки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий350</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>Ценная бумага</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСостояниюНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ОтправкаПериодическихВыписокПоСчетуДЕПО/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура создает (или находит ранее созданные) выписки о состоянии счета депо
// на основании имеющихся в базе актуальных поручений на ежедневную отправку таких выписок.
// Затем создает необходимый пакет документов и отправляет выписки через интеграционный шлюз.
// Другие виды периодичности кроме "ежедневно" (что подразумевает ежедневно по рабочим дням
// за предыдущий рабочий день) пока не поддерживаются.
// При вызове из регламентного задания формирование выписки происходит только по рабочим
// дням, причем дата отчета не указывается в параметре, а вычисляется как последний рабочий
// день перед текущей датой.
// Параметры:
//	ДатаОтчета - Дата - выписка формируется по состоянию на конец этой даты. Если она не указана,
//						то берется вчерашний день
Процедура СозданиеИОтправкаВыписок(ДатаОтчета = Неопределено) Экспорт
	Если ДатаОтчета = Неопределено Тогда
		ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
		Если Не ОбщегоНазначения.РабочийДень(ТекущаяДата) Тогда
			Возврат;
		КонецЕсли;
		ДатаОтчета = ОбщегоНазначения.ПредыдущийРабочийДень(ТекущаяДата);
	Иначе
		Если Не ОбщегоНазначения.РабочийДень(ДатаОтчета) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НайтиПоручения(ДатаОтчета);
	Для каждого СтрокаТЧ Из Поручения Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Поручение) И Не ЗначениеЗаполнено(СтрокаТЧ.ИсходящийПакетВФШ) Тогда
			СтрокаТЧ.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	СоздатьВыписки(ДатаОтчета);
	СформироватьИОтправитьОтчеты(ДатаОтчета);
КонецПроцедуры

// Процедура находит ранее созданные выписки о состоянии счета депо на основании имеющихся
// в базе актуальных поручений на ежедневную отправку таких выписок, а также информацию об
// из выгрузке в интеграциионный (файловый) шлюз.
// Другие виды периодичности кроме "ежедневно" (что подразумевает ежедневно по рабочим дням
// за предыдущий рабочий день) пока не поддерживаются.
// Параметры:
//	ДатаОтчета - Дата - искомые выписки должны быть сфорованы по состоянию на конец этой даты.
Процедура НайтиПоручения(ДатаОтчета) Экспорт
	Поручения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументПоручение.Ссылка КАК Поручение,
	|	Выписка.Ссылка КАК Выписка,
	|	МАКСИМУМ(ТехническаяОперация.Дата) КАК ДатаПоследнейТехническойОперации
	|ПОМЕСТИТЬ ВТ_ПорученияИТехоперации
	|ИЗ
	|	Документ.Поручение КАК ДокументПоручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений КАК СтатусыПоручений
	|		ПО ДокументПоручение.Ссылка = СтатусыПоручений.Поручение
	|			И (СтатусыПоручений.СтатусПоручения = ЗНАЧЕНИЕ(Перечисление.СтатусыПоручений.Обрабатывается))
	|			И (ДокументПоручение.ВидОперацииД = ЗНАЧЕНИЕ(Перечисление.ВидыОтчетов.ВыпискаОСостоянииСчетаДЕПО))
	|			И (ДокументПоручение.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностиРасписанийРассылокОтчетов.Ежедневно))
	|			И (ДокументПоручение.ДатаНачПериода <= &ДатаОтчета)
	|			И (ДокументПоручение.Проведен)
	|			И (ДокументПоручение.ДатаИсполненияПоручения = ДАТАВРЕМЯ(1, 1, 1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка КАК Выписка
	|		ПО ДокументПоручение.Ссылка = Выписка.ДокументОснование
	|			И (Выписка.ДатаКонПериода = &ПоСостояниюНа)
	|			И (НЕ Выписка.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТехническаяОперация КАК ТехническаяОперация
	|		ПО (Выписка.Ссылка = ТехническаяОперация.ДокументОснование)
	|			И (НЕ ТехническаяОперация.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументПоручение.Ссылка,
	|	Выписка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорученияИТехоперации.Поручение КАК Поручение,
	|	ВТ_ПорученияИТехоперации.Выписка КАК Выписка,
	|	ТехническаяОперация.Ссылка КАК ТехническаяОперация,
	|	ИсходящийПакетВФайловыйШлюз.Ссылка КАК ИсходящийПакетВФайловыйШлюз
	|ПОМЕСТИТЬ ВТ_ПорученияИИсполнение
	|ИЗ
	|	ВТ_ПорученияИТехоперации КАК ВТ_ПорученияИТехоперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТехническаяОперация КАК ТехническаяОперация
	|		ПО ВТ_ПорученияИТехоперации.Выписка = ТехническаяОперация.ДокументОснование
	|			И ВТ_ПорученияИТехоперации.ДатаПоследнейТехническойОперации = ТехническаяОперация.Дата
	|			И (НЕ ТехническаяОперация.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсходящийПакетВФайловыйШлюз КАК ИсходящийПакетВФайловыйШлюз
	|		ПО (ТехническаяОперация.Ссылка = ИсходящийПакетВФайловыйШлюз.ДокументОснование)
	|			И (НЕ ИсходящийПакетВФайловыйШлюз.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ КАК Документ,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус КАК Статус,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Пакет КАК Пакет
	|ПОМЕСТИТЬ ВТ_СостоянияДокументовВФШ
	|ИЗ
	|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(
	|			,
	|			Документ В
	|				(ВЫБРАТЬ
	|					ВТ_ПорученияИИсполнение.ТехническаяОперация КАК ТехническаяОперация
	|				ИЗ
	|					ВТ_ПорученияИИсполнение КАК ВТ_ПорученияИИсполнение)) КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПорученияИИсполнение.Поручение КАК Поручение,
	|	ВТ_ПорученияИИсполнение.Выписка КАК Выписка,
	|	СчетаДепо.Ссылка КАК СчетДепо,
	|	ВТ_ПорученияИИсполнение.ТехническаяОперация КАК ТехническаяОперация,
	|	ВТ_СостоянияДокументовВФШ.Статус КАК Статус,
	|	ВЫБОР
	|		КОГДА ВТ_СостоянияДокументовВФШ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовФайловыйШлюз.ПринятоКИсполнению)
	|			ТОГДА ВТ_ПорученияИИсполнение.ИсходящийПакетВФайловыйШлюз
	|		ИНАЧЕ ВТ_СостоянияДокументовВФШ.Пакет
	|	КОНЕЦ КАК ИсходящийПакетВФШ
	|ИЗ
	|	ВТ_ПорученияИИсполнение КАК ВТ_ПорученияИИсполнение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияДокументовВФШ КАК ВТ_СостоянияДокументовВФШ
	|		ПО ВТ_ПорученияИИсполнение.ТехническаяОперация = ВТ_СостоянияДокументовВФШ.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ДокументПоручение
	|		ПО ВТ_ПорученияИИсполнение.Поручение = ДокументПоручение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО (ДокументПоручение.СчетДепо = СчетаДепо.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетаДепо.Код";
	Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтчета);
	ПоСостояниюНа = КонецДня(ДатаОтчета);
	Запрос.УстановитьПараметр("ПоСостояниюНа", ПоСостояниюНа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаТЧ = Поручения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, Выборка);
	КонецЦикла;
КонецПроцедуры

// Процедура создает недостатющие документы Выписка в помеченных строках. Если помечена трока с поручением по которому
// уже есть выписка за указанную дату - новая выписк не создается. При формировании новых выписок также создаются документы 
// ФормированиеОтчетаВыписки.
// Параметры:
//	ДатаОтчета - Дата - выписка формируется по состоянию на конец этой даты. Если она не указана,
//						то берется вчерашний день
Процедура СоздатьВыписки(ДатаОтчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тзПоручения.Пометка КАК Пометка,
	|	тзПоручения.Поручение КАК Поручение,
	|	тзПоручения.Выписка КАК Выписка,
	|	тзПоручения.ИсходящийПакетВФШ КАК ИсходящийПакетВФШ,
	|	тзПоручения.НомерСтроки КАК НомерСтрокиТЧ
	|ПОМЕСТИТЬ ВТ_Поручения
	|ИЗ
	|	&Поручения КАК тзПоручения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Поручения.Поручение КАК Поручение,
	|	ДокументВыписка.Ссылка КАК Выписка,
	|	ДокументПоручение.СчетДепо КАК СчетДепо,
	|	ВТ_Поручения.НомерСтрокиТЧ КАК НомерСтрокиТЧ
	|ИЗ
	|	ВТ_Поручения КАК ВТ_Поручения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ДокументПоручение
	|		ПО ВТ_Поручения.Поручение = ДокументПоручение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка КАК ДокументВыписка
	|		ПО ВТ_Поручения.Выписка = ДокументВыписка.Ссылка
	|			И ВТ_Поручения.Поручение = ДокументВыписка.ДокументОснование
	|			И (ДокументВыписка.ДатаКонПериода = &ПоСостояниюНа)
	|			И (НЕ ДокументВыписка.ПометкаУдаления)
	|			И (ВТ_Поручения.Пометка)";
	Запрос.УстановитьПараметр("Поручения", Поручения.Выгрузить(, "Пометка,Поручение,Выписка,ИсходящийПакетВФШ,НомерСтроки"));
	ПоСостояниюНа = КонецДня(ДатаОтчета);
	Запрос.УстановитьПараметр("ПоСостояниюНа", ПоСостояниюНа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Поручения[Выборка.НомерСтрокиТЧ - 1];
		Если Не ЗначениеЗаполнено(Выборка.Выписка) Тогда
			Документ = Документы.ФормированиеОтчетаВыписки.СоздатьДокумент();
			Документ.Заполнить(Выборка.Поручение);
			Документ.Дата = ТекущаяДатаСеанса();
			Документ.ПоСостояниюНа = ПоСостояниюНа;
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаТЧ.Выписка = Документ.ДополнительныеСвойства.Выписка;
		Иначе
			СтрокаТЧ.Выписка = Выборка.Выписка;
		КонецЕсли;
		Текст = ТекстСообщенияОСозданииВыписки(Выборка.Поручение, Выборка.Выписка, Выборка.СчетДепо, ПоСостояниюНа);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЦикла;
КонецПроцедуры

// Процедура формирует документы ТехническаяОперация и ИсходящийПакетВФайловыйШлюз к уже имеющимся документуам Выписка,
// а также непосредственно формирует Выписки (отчет) и выгружает их в файловый шлюз
// Параметры:
//	ДатаОтчета - Дата - Выписка как отчет формируется по состоянию на конец этой даты.
Процедура СформироватьИОтправитьОтчеты(ДатаОтчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тзПоручения.Пометка КАК Пометка,
	|	тзПоручения.Поручение КАК Поручение,
	|	тзПоручения.Выписка КАК Выписка,
	|	тзПоручения.ИсходящийПакетВФШ КАК ИсходящийПакетВФШ,
	|	тзПоручения.ТехническаяОперация КАК ТехническаяОперация,
	|	тзПоручения.НомерСтроки КАК НомерСтрокиТЧ
	|ПОМЕСТИТЬ ВТ_Поручения
	|ИЗ
	|	&Поручения КАК тзПоручения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Поручения.Поручение КАК Поручение,
	|	ВТ_Поручения.Выписка КАК Выписка,
	|	ВТ_Поручения.НомерСтрокиТЧ КАК НомерСтрокиТЧ
	|ИЗ
	|	ВТ_Поручения КАК ВТ_Поручения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Выписка КАК ДокументВыписка
	|		ПО ВТ_Поручения.Выписка = ДокументВыписка.Ссылка
	|			И ВТ_Поручения.Поручение = ДокументВыписка.ДокументОснование
	|			И (ДокументВыписка.ДатаКонПериода = &ПоСостояниюНа)
	|			И (НЕ ДокументВыписка.ПометкаУдаления)
	|			И (ВТ_Поручения.Пометка)";
	СписокВыгружаемыхКолонок = "Пометка,Поручение,Выписка,ТехническаяОперация,ИсходящийПакетВФШ,НомерСтроки";
	Запрос.УстановитьПараметр("Поручения", Поручения.Выгрузить(, СписокВыгружаемыхКолонок));
	Запрос.УстановитьПараметр("ПоСостояниюНа", КонецДня(ДатаОтчета));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СформироватьИОтправитьОдинОтчет(Выборка.Поручение, Выборка.Выписка, Выборка.НомерСтрокиТЧ);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

Функция ТекстСообщенияОСозданииВыписки(Поручение, Выписка, СчетДепо, ПоСостояниюНа)
	Текст = "На основании " + СтрЗаменить(Строка(Поручение), "Поручение", "поручения");
	Если ЗначениеЗаполнено(Выписка) Тогда
		Текст = "(!) " + Текст + " ранее уже была создана " + СтрЗаменить(Строка(Выписка), "Выписка", "выписка");
	Иначе
		Текст = Текст + " создана выписка ";
	КонецЕсли;
	Текст = Текст + " с информацией по счету ДЕПО " + СокрЛП(Строка(СчетДепо)) + " по состоянию на " + Строка(ПоСостояниюНа);
	
	Возврат Текст;
КонецФункции

Процедура СформироватьИОтправитьОдинОтчет(Поручение, Выписка, НомерСтрокиТЧ)
	Ошибка = ВнешниеДанные.НовоеОписаниеОшибкиДляРегистрацииИОповещения();
	
	ВыпискаОтчет = Отчеты.ВыпискаОСостоянииСчетаДепо.Создать();
	ВыпискаОтчет.Выписка = Выписка;
	ВыпискаОтчет.ВидЗапроса = "Депонентов";
	ВыпискаОтчет.ЗаполнитьРеквизитыОтчетаПоВыписке();
	ТабДок = Новый ТабличныйДокумент;
	
	БезУполномоченного = Истина;
	ОтчетРезультат = ВыпискаОтчет.СформироватьОтчет(ТабДок, БезУполномоченного);
	
	Если ОтчетРезультат = Неопределено Тогда
		Ошибка.СообщениеВЖурнал = "При попытке сформировать отчет ""Выписка о состоянии счета депо"" на основании документа "
					+ Строка(Выписка) + " (созданного на основании поручения " + Строка(Поручение) + ") произошла ошибка ... ";
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;
	Иначе
		СформироватьИсходящийПакетВИнтеграционныйШлюз(Выписка, ОтчетРезультат, НомерСтрокиТЧ, Ошибка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибка.СообщениеПользователю) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка.СообщениеПользователю);
	КонецЕсли;
	Если ЗначениеЗаполнено(Ошибка.СообщениеВЖурнал) Тогда
		ИмяСобытия = "Отправка периодических выписок по счету депо";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , Ошибка.Данные,
			Ошибка.СообщениеВЖурнал);
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьИсходящийПакетВИнтеграционныйШлюз(Выписка, ОтчетРезультат, НомерСтрокиТЧ, Ошибка)
	РасширениеPDF = ".PDF";
	ВнешнийИсточникФайловыйШлюзКаталогКОтправке = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогКОтправке;
	ПутьДляВыгрузки = ВнешниеДанные.ПутьКВнешнемуИсточникуКаталогу(ВнешнийИсточникФайловыйШлюзКаталогКОтправке, Ошибка);
	Если ПутьДляВыгрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	НовыйПорядковыйНомерТехническойОперации = Документы.ТехническаяОперация.НовыйПорядковыйНомерВТечениеДня(ТекущаяДата);
	Если НовыйПорядковыйНомерТехническойОперации = 0 Тогда
		Ошибка.СообщениеВЖурнал = "Не удалось получить новый порядковый номер для технической операции за " + Формат(ТекущаяДата, "ДЛФ=Д");
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;
		Возврат;
	КонецЕсли;
	
	ИмяПодкаталога = ИмяПодкаталогаДляВыгрузки(ТекущаяДата, НовыйПорядковыйНомерТехническойОперации);
	ПолноеИмяКаталогаДляФайлаPDF = ПолноеИмяКаталогаДляВыгрузкиФайлаPDF(ПутьДляВыгрузки, ИмяПодкаталога, ТекущаяДата, 
																	НовыйПорядковыйНомерТехническойОперации);
	СоздатьКаталог(ПолноеИмяКаталогаДляФайлаPDF);
	
	РеквизитыВыписки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выписка, "ВладелецСчета, Дата, Номер, СчетДепо, ДатаКонПериода");
	НомерСчетаДепо = СокрЛП(РеквизитыВыписки.СчетДепо.Код);
	ДатаВыпискиСтрокой = Формат(РеквизитыВыписки.ДатаКонПериода, "ДФ=""дд_ММ_гггг""");
	ИмяФайлаPDF = "Выписка_о_состоянии_счета_ДЕПО_N_" + НомерСчетаДепо + "_на_" + ДатаВыпискиСтрокой;
	ПолноеИмяФайлаPDF = ПолноеИмяКаталогаДляФайлаPDF + "\" + ИмяФайлаPDF + РасширениеPDF;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеPDF);
	Попытка
		ОтчетРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	Исключение
		Ошибка.СообщениеВЖурнал = "Не удалось записать файл " + ИмяФайлаPDF + РасширениеPDF;
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;
		Возврат;
	КонецПопытки;
	
	НоваяТехническаяОперация = НовыйДокументТехническаяОперация(НовыйПорядковыйНомерТехническойОперации, Выписка, РеквизитыВыписки);
	РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДата,
		НоваяТехническаяОперация.Ссылка, Перечисления.СтатусыДокументовФайловыйШлюз.ВыгрузитьФайловыйШлюз);
	
	НовыйИсходящийПакет = НовыйДокументИсходящийПакетВФайловыйШлюз(НоваяТехническаяОперация, ИмяПодкаталога,
																	ПолноеИмяКаталогаДляФайлаPDF, ТекущаяДата);
	СтатусВыгружено = Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоФайловыйШлюз;
	РегистрыСведений.СостоянияДокументовВФайловомШлюзе.ДобавитьЗапись(ТекущаяДатаСеанса(), НоваяТехническаяОперация.Ссылка,
		СтатусВыгружено, НовыйИсходящийПакет.Ссылка);
	РегистрыСведений.ДокументыВыгруженныеВЛуч.ДобавитьДокумент(Выписка, ТекущаяДата, НоваяТехническаяОперация.Номер, "",
		ПараметрыСеанса.ТекущийПользователь);
	
	ПереместитьФайл(ИмяВременногоФайла, ПолноеИмяФайлаPDF);
	СоздатьФайлWINF(РеквизитыВыписки, НоваяТехническаяОперация, ПолноеИмяКаталогаДляФайлаPDF, ИмяПодкаталога, ИмяФайлаPDF, Ошибка);
	
	СтрокаТЧ = Поручения[НомерСтрокиТЧ - 1];
	СтрокаТЧ.ИсходящийПакетВФШ = НовыйИсходящийПакет.Ссылка;
	СтрокаТЧ.ТехническаяОперация = НоваяТехническаяОперация.Ссылка;
	СтрокаТЧ.Статус = СтатусВыгружено;
	
	Если Не ЗначениеЗаполнено(Ошибка.СообщениеВЖурнал) И Не ЗначениеЗаполнено(Ошибка.СообщениеПользователю) Тогда
		Текст = "Выписка выгружена в файл " + ПолноеИмяФайлаPDF;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЕсли;
КонецПроцедуры

Функция ИмяПодкаталогаДляВыгрузки(ТекущаяДата, НовыйПорядковыйНомер)
	Префикс = "W";	 // Транзит
	НомерДня = Формат(ТекущаяДата, "ДФ=dd");
	НомерМесяца = СтроковыеФункцииКлиентСервер.МесяцВШестнадцатеричнойСистеме(Месяц(ТекущаяДата));
	ИмяПодкаталога = Префикс + НомерДня + НомерМесяца + Формат(НовыйПорядковыйНомер, "ЧЦ=4; ЧВН=; ЧГ=0");
	
	Возврат ИмяПодкаталога;
КонецФункции

Функция ПолноеИмяКаталогаДляВыгрузкиФайлаPDF(ПутьДляВыгрузки, ИмяПодкатолога, ТекущаяДата, НовыйПорядковыйНомер)
	ПолноеИмяКаталогаДляФайла = ПутьДляВыгрузки + "\" + ИмяПодкатолога;
	
	КаталогДляФайла = Новый Файл(ПолноеИмяКаталогаДляФайла);
	Пока КаталогДляФайла.Существует() Цикл
		НовыйПорядковыйНомер = НовыйПорядковыйНомер + 1;
		ИмяПодкаталога = ИмяПодкаталогаДляВыгрузки(ТекущаяДата, НовыйПорядковыйНомер);
		ПолноеИмяКаталогаДляФайла = ПутьДляВыгрузки + "\" + ИмяПодкаталога;
		КаталогДляФайла = Новый Файл(ПолноеИмяКаталогаДляФайла);
	КонецЦикла;
	
	Возврат ПолноеИмяКаталогаДляФайла;
КонецФункции

Функция НовыйДокументТехническаяОперация(НовыйПорядковыйНомер, Выписка, РеквизитыВыписки)
	НоваяТехническаяОперация = Документы.ТехническаяОперация.СоздатьДокумент();
	НоваяТехническаяОперация.Дата = ТекущаяДатаСеанса();
	НоваяТехническаяОперация.НомерДокументаОснования = СокрЛП(РеквизитыВыписки.Номер);
	НоваяТехническаяОперация.ДатаДокументаОснования = РеквизитыВыписки.Дата;
	НоваяТехническаяОперация.ТипОперации = "TRZT";
	НоваяТехническаяОперация.КодОперации = "NDC0STND";
	НоваяТехническаяОперация.ДокументОснование = Выписка;
	НоваяТехническаяОперация.ПорядковыйНомерВнутриДня = НовыйПорядковыйНомер;
	НоваяТехническаяОперация.УстановитьНовыйНомер();
	НоваяТехническаяОперация.Записать(РежимЗаписиДокумента.Проведение);
		
	Возврат НоваяТехническаяОперация;
КонецФункции

Функция НовыйДокументИсходящийПакетВФайловыйШлюз(НоваяТехническаяОперация, ИмяПодкаталога, ПолноеИмяКаталогаДляФайлаPDF, ТекущаяДата)
	НовыйИсходящийПакет = Документы.ИсходящийПакетВФайловыйШлюз.СоздатьДокумент();
	НовыйИсходящийПакет.Дата = ТекущаяДатаСеанса();
	НовыйИсходящийПакет.ДокументОснование = НоваяТехническаяОперация.Ссылка;
	НовыйИсходящийПакет.ОтносительныйПуть = ИмяПодкаталога;
	НовыйИсходящийПакет.ПолныйПуть = ПолноеИмяКаталогаДляФайлаPDF;
	НовыйИсходящийПакет.Статус = Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоФайловыйШлюз;
	НовыйИсходящийПакет.Комментарий = "Создан автоматически в " + Формат(ТекущаяДата, "ДЛФ=DT");
	НовыйИсходящийПакет.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат НовыйИсходящийПакет;
КонецФункции

Процедура СоздатьФайлWINF(РеквизитыВыписки, ТехническаяОперация, ПолноеИмяКаталога, ИмяПодкаталога, ИмяФайлаPDF, Ошибка)
	РасширениеXML = ".XML";
	ПолноеИмяФайлаWINF = ПолноеИмяКаталога + "\" + "winf" + РасширениеXML;
	ИмяВременногоФайлаWINF = ПолучитьИмяВременногоФайла(РасширениеXML);
	ЗаписьXML = Новый ЗаписьXML;
	Попытка
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаWINF, "windows-1251");
	Исключение
		Ошибка.СообщениеВЖурнал = "Не удалось открыть файл " + "winf" + РасширениеXML;
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;
		Возврат;
	КонецПопытки;
	ТекстСообщенияWINF = ТекстСообщенияТранзитаWINF(РеквизитыВыписки, ТехническаяОперация, ПолноеИмяКаталога, ИмяПодкаталога, ИмяФайлаPDF);
	ЗаписьXML.ЗаписатьБезОбработки(ТекстСообщенияWINF);
	ЗаписьXML.Закрыть();
	ПереместитьФайл(ИмяВременногоФайлаWINF, ПолноеИмяФайлаWINF);
КонецПроцедуры

Функция ТекстСообщенияТранзитаWINF(РеквизитыВыписки, ТехническаяОперация, ИмяКаталога, ИмяПодкаталога, ИмяФайлаXML)
	
	СтруктураПараметров = ПараметрыТранзитаWINF(РеквизитыВыписки, ТехническаяОперация, ИмяКаталога, ИмяПодкаталога, ИмяФайлаXML);
	ТекстСообщения = ПолучитьМакет("ИсходящийШаблонТранзитWINF").ПолучитьТекст();
	Для Каждого Элемент Из СтруктураПараметров Цикл
		КлючПоиска = "[" + Элемент.Ключ + "]";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, КлючПоиска, Элемент.Значение);
	КонецЦикла;
	
	Возврат ТекстСообщения;
КонецФункции

Функция ПараметрыТранзитаWINF(РеквизитыВыписки, ТехническаяОперация, ИмяКаталога, ИмяПодкаталога, ИмяФайлаPDF)
	
	ПараметрыТранзита = Новый Структура;
	КлассификаторНРД = Справочники.КлассификаторыЗагрузки.НДЦ();
	Организация = ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию();
	ORIGINATOR = Справочники.Организации.КодЗагрузки(Организация, КлассификаторНРД, РеквизитыВыписки.Дата);
	ПараметрыТранзита.Вставить("ORIGINATOR", СокрЛП(ORIGINATOR));
	RECIPIENT = Справочники.КодыЗагрузки.НайтиПоВладельцуИБирже(РеквизитыВыписки.ВладелецСчета, КлассификаторНРД, РеквизитыВыписки.Дата);
	ПараметрыТранзита.Вставить("RECIPIENT", СокрЛП(RECIPIENT));
	GUID = XMLСтрока(ТехническаяОперация.Ссылка);
	ПараметрыТранзита.Вставить("GUID", GUID);
	DATE = Формат(ТехническаяОперация.Дата, "ДФ=dd.MM.yyyy");
	ПараметрыТранзита.Вставить("DATE", DATE);
	TIME = Формат(ТехническаяОперация.Дата, "ДФ=HH:mm:ss");
	ПараметрыТранзита.Вставить("TIME", TIME);
	DOC = СтрЗаменить(ОбщегоНазначенияКлиентСервер.Транслит(СокрЛП(РеквизитыВыписки.Номер)), "-", "");
	ПараметрыТранзита.Вставить("DOC", DOC);
	NAME = ИмяПодкаталога;
	ПараметрыТранзита.Вставить("NAME", NAME);
	FILE = ИмяФайлаPDF + ".pdf";
	ПараметрыТранзита.Вставить("FILE", FILE);
	
	Возврат ПараметрыТранзита;
КонецФункции

#КонецОбласти
